Model: "functional_model2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
DBDs (InputLayer)               [(None, 1, 6804)]    0                                            
__________________________________________________________________________________________________
lstm (LSTM)                     (None, 176)          4914624     DBDs[0][0]                       
__________________________________________________________________________________________________
paarweiseAehnlichkeiten (InputL [(None, 1, 1618)]    0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 176)          0           lstm[0][0]                       
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 500)          4238000     paarweiseAehnlichkeiten[0][0]    
__________________________________________________________________________________________________
dense (Dense)                   (None, 704)          124608      dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 500)          0           lstm_1[0][0]                     
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 352)          248160      dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 102)          51102       dropout_1[0][0]                  
__________________________________________________________________________________________________
flatten (Flatten)               (None, 352)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 102)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 454)          0           flatten[0][0]                    
                                                                 flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 704)          320320      concatenate[0][0]                
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 352)          248160      dense_3[0][0]                    
__________________________________________________________________________________________________
pwm (Dense)                     (None, 176)          62128       dense_4[0][0]                    
__________________________________________________________________________________________________
zuordnung (Dense)               (None, 51)           18003       dense_4[0][0]                    
==================================================================================================
Total params: 10,225,105
Trainable params: 10,225,105
Non-trainable params: 0
__________________________________________________________________________________________________
