Model: "functional_model2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
DBDs (InputLayer)               [(None, 6804)]       0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 176)          1197680     DBDs[0][0]                       
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 704)          124608      dense[0][0]                      
__________________________________________________________________________________________________
paarweiseAehnlichkeiten (InputL [(None, 1618)]       0                                            
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1408)         992640      dense_1[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 2000)         3238000     paarweiseAehnlichkeiten[0][0]    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 1408)         0           dense_2[0][0]                    
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 2000)         0           dense_3[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 3408)         0           flatten[0][0]                    
                                                                 flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 704)          2399936     concatenate[0][0]                
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 352)          248160      dense_5[0][0]                    
__________________________________________________________________________________________________
pwm (Dense)                     (None, 176)          62128       dense_6[0][0]                    
__________________________________________________________________________________________________
zuordnung (Dense)               (None, 51)           18003       dense_6[0][0]                    
==================================================================================================
Total params: 8,281,155
Trainable params: 8,281,155
Non-trainable params: 0
__________________________________________________________________________________________________
